mediaMicroservices/wrk2/rebuttal_results/c5.xlarge/phone_60s_r400.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 484.378ms, rate sampling interval: 2381ms
  Thread calibration: mean lat.: 508.501ms, rate sampling interval: 2115ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   464.90ms  444.17ms   1.89s    80.39%
    Req/Sec   199.53     11.73   217.00     72.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  295.68ms
 75.000%  688.64ms
 90.000%    1.14s 
 99.000%    1.89s 
 99.900%    2.15s 
 99.990%    2.21s 
 99.999%    2.22s 
100.000%    2.22s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.099     0.000000            1         1.00
      56.063     0.100000         1991         1.11
      96.383     0.200000         3981         1.25
     148.735     0.300000         5973         1.43
     216.447     0.400000         7960         1.67
     295.679     0.500000         9951         2.00
     354.815     0.550000        10947         2.22
     421.375     0.600000        11941         2.50
     500.479     0.650000        12935         2.86
     590.335     0.700000        13936         3.33
     688.639     0.750000        14928         4.00
     745.471     0.775000        15425         4.44
     837.119     0.800000        15923         5.00
     900.607     0.825000        16419         5.71
     969.215     0.850000        16916         6.67
    1044.479     0.875000        17413         8.00
    1091.583     0.887500        17664         8.89
    1137.663     0.900000        17912        10.00
    1187.839     0.912500        18158        11.43
    1245.183     0.925000        18408        13.33
    1323.007     0.937500        18659        16.00
    1357.823     0.943750        18781        17.78
    1399.807     0.950000        18910        20.00
    1433.599     0.956250        19033        22.86
    1464.319     0.962500        19157        26.67
    1502.207     0.968750        19279        32.00
    1524.735     0.971875        19340        35.56
    1549.311     0.975000        19402        40.00
    1602.559     0.978125        19464        45.71
    1652.735     0.981250        19526        53.33
    1790.975     0.984375        19589        64.00
    1846.271     0.985938        19620        71.11
    1864.703     0.987500        19652        80.00
    1881.087     0.989062        19682        91.43
    1901.567     0.990625        19714       106.67
    1957.887     0.992188        19744       128.00
    1977.343     0.992969        19761       142.22
    1987.583     0.993750        19775       160.00
    2000.895     0.994531        19791       182.86
    2023.423     0.995313        19806       213.33
    2052.095     0.996094        19822       256.00
    2072.575     0.996484        19831       284.44
    2096.127     0.996875        19837       320.00
    2107.391     0.997266        19847       365.71
    2111.487     0.997656        19854       426.67
    2117.631     0.998047        19861       512.00
    2125.823     0.998242        19865       568.89
    2129.919     0.998437        19868       640.00
    2138.111     0.998633        19872       731.43
    2150.399     0.998828        19876       853.33
    2156.543     0.999023        19880      1024.00
    2158.591     0.999121        19884      1137.78
    2158.591     0.999219        19884      1280.00
    2162.687     0.999316        19886      1462.86
    2170.879     0.999414        19888      1706.67
    2172.927     0.999512        19890      2048.00
    2174.975     0.999561        19892      2275.56
    2174.975     0.999609        19892      2560.00
    2183.167     0.999658        19893      2925.71
    2197.503     0.999707        19894      3413.33
    2207.743     0.999756        19897      4096.00
    2207.743     0.999780        19897      4551.11
    2207.743     0.999805        19897      5120.00
    2207.743     0.999829        19897      5851.43
    2207.743     0.999854        19897      6826.67
    2207.743     0.999878        19897      8192.00
    2207.743     0.999890        19897      9102.22
    2213.887     0.999902        19898     10240.00
    2213.887     0.999915        19898     11702.86
    2213.887     0.999927        19898     13653.33
    2213.887     0.999939        19898     16384.00
    2213.887     0.999945        19898     18204.44
    2222.079     0.999951        19899     20480.00
    2222.079     1.000000        19899          inf
#[Mean    =      464.898, StdDeviation   =      444.165]
#[Max     =     2220.032, Total count    =        19899]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23613 requests in 1.00m, 4.15MB read
  Non-2xx or 3xx responses: 69
Requests/sec:    393.54
Transfer/sec:     70.91KB