mediaMicroservices/wrk2/rebuttal_results/c5.xlarge/phone_60s_r50.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.704ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.924ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.82ms    1.09ms   8.24ms   89.25%
    Req/Sec    25.97     51.89   222.00     77.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.51ms
 75.000%    3.91ms
 90.000%    4.98ms
 99.000%    8.24ms
 99.900%   15.25ms
 99.990%   16.70ms
 99.999%   16.70ms
100.000%   16.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.737     0.000000            1         1.00
       3.077     0.100000          250         1.11
       3.209     0.200000          493         1.25
       3.309     0.300000          743         1.43
       3.411     0.400000          989         1.67
       3.511     0.500000         1235         2.00
       3.563     0.550000         1357         2.22
       3.621     0.600000         1487         2.50
       3.685     0.650000         1604         2.86
       3.761     0.700000         1730         3.33
       3.909     0.750000         1851         4.00
       4.007     0.775000         1912         4.44
       4.135     0.800000         1973         5.00
       4.287     0.825000         2035         5.71
       4.475     0.850000         2096         6.67
       4.727     0.875000         2158         8.00
       4.863     0.887500         2188         8.89
       4.979     0.900000         2222        10.00
       5.151     0.912500         2253        11.43
       5.259     0.925000         2281        13.33
       5.395     0.937500         2312        16.00
       5.463     0.943750         2327        17.78
       5.615     0.950000         2343        20.00
       5.799     0.956250         2358        22.86
       6.119     0.962500         2373        26.67
       6.495     0.968750         2388        32.00
       6.659     0.971875         2396        35.56
       6.827     0.975000         2404        40.00
       7.047     0.978125         2412        45.71
       7.247     0.981250         2419        53.33
       7.487     0.984375         2427        64.00
       7.759     0.985938         2431        71.11
       8.015     0.987500         2435        80.00
       8.199     0.989062         2439        91.43
       8.295     0.990625         2442       106.67
       8.799     0.992188         2446       128.00
       8.983     0.992969         2448       142.22
       9.199     0.993750         2450       160.00
       9.311     0.994531         2452       182.86
       9.511     0.995313         2454       213.33
       9.735     0.996094         2456       256.00
       9.863     0.996484         2457       284.44
      10.079     0.996875         2458       320.00
      10.159     0.997266         2459       365.71
      10.319     0.997656         2460       426.67
      11.871     0.998047         2461       512.00
      11.871     0.998242         2461       568.89
      14.839     0.998437         2462       640.00
      14.839     0.998633         2462       731.43
      15.247     0.998828         2463       853.33
      15.247     0.999023         2463      1024.00
      15.247     0.999121         2463      1137.78
      15.919     0.999219         2464      1280.00
      15.919     0.999316         2464      1462.86
      15.919     0.999414         2464      1706.67
      15.919     0.999512         2464      2048.00
      15.919     0.999561         2464      2275.56
      16.703     0.999609         2465      2560.00
      16.703     1.000000         2465          inf
#[Mean    =        3.820, StdDeviation   =        1.089]
#[Max     =       16.688, Total count    =         2465]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3001 requests in 1.00m, 539.24KB read
Requests/sec:     50.01
Transfer/sec:      8.99KB